# -*- coding: utf-8 -*-
"""
Created on Thu Mar 23 13:30:24 2017

@author: Robert
"""

class controller():
    
    def gtprst(self):
        prst = ('в', 'во', 'взо', 'вы', 'до', 'за', 'из', 'изо', 'на', 'над',
                    'не', 'недо', 'о', 'об', 'обо', 'от', 'ото', 'па', 'пере', 'по', 
                    'под', 'подо', 'пра', 'пред', 'предо', 'про', 'разо', 'с', 'со', 
                    'су', 'у', 'без', 'бес', 'вз', 'вс', 'воз', 'вос', 'из', 'ис', 'низ',
                    'нис', 'раз', 'рас', 'роз', 'рос', 'через', 'черес', 'пре', 'при', 
                    'долго', 'ре', 'много', 'само', 'ино', 'объ','дис','анти', 'квази')
            
        return(prst)
        
    def gtart(self):
        art = ('куча', 'умека', 'полутора', 'нота', 'пента', 'ра', 'куда', 'инал', 'гна', 
                   'тка', 'ха', 'аква', 'дека', 'мега', 'тетра', 'пила', 'изба', 'кита',
                   'камера', 'кра', 'ча', 'са', 'ржа', 'завтра', 'стара', 'база', 'ката',
                   'агора', 'пха', 'мута', 'луна', 'ба', 'зва', 'кока', 'доста', 'сюда', 
                   'летка', 'авиа', 'гамма', 'два', 'па', 'рова', 'гра', 'рубаха', 'пока',
                   'булга', 'горноста', 'ака', 'вла', 'прима', 'орга', 'да', 'мета', 'когда',
                   'ква', 'ма', 'зда', 'фата', 'ага', 'а', 'сла', 'туда', 'тра', 'кислота',
                   'балала', 'та', 'пара', 'буга', 'стра', 'бра', 'плазма', 'дра', 'сва', 
                   'едва', 'грамма', 'вра', 'пла', 'моза', 'машина', 'экстра', 'жа', 'драма',
                   'ура', 'схема', 'ла', 'ка', 'хурда', 'жра', 'за', 'окта', 'лампа', 
                   'лиша', 'игла', 'тогда', 'педа', 'фабрика', 'гала', 'сема', 'ультра', 'тонна', 
                   'ста', 'сара', 'на', 'кла', 'зна', 'попуга', 'минера', 'касса', 'пра', 'карава')
        return(art)
            
    def gtpost(self):
        postfix = ('ъ', 'а', 'я', 'о', 'е', 'ь', 'и', 'ы', 'а', 'ая', 'яя', 'ое', 'ее', 'ый', 'ать', 
                   'ять', 'еть', 'уть', 'у', 'ю', 'ем', 'ешь', 'ете', 'ет', 'ут', 'ют', 'ал', 'ял', 'ала',
                   'яла', 'али', 'яли', 'ул', 'ула', 'ули', 'а', 'ам', 'ами', 'ас', 'am', 'ax', 'ая', 'е', 
                   'её', 'ей', 'ем', 'еми', 'ex', 'ею', 'ёт', 'ёте', 'ёх', 'ёшь', 'и', 'ие', 'ий',
                   'им', 'ими', 'ит', 'ите', 'их', 'ишь', 'ию', 'ыми', 'ми', 'мя', 'о', 'ов', 'ого', 'ость',
                   'ое', 'оё', 'ой', 'ом', 'ому', 'ою', 'cm', 'у', 'ум', 'умя', 'ут', 'ух', 'ую', 'шь', 'оть', 'ия',
                   'ить', 'ев','ые','ым','ят', 'ых', 'ии','ах')
        return(postfix)
            
        
        
        
        
    def gtsfx(self):
            
        mysfx = ('ятин', 'ёшк', 'атур', 'от', 'ева', 'арх', 'ельник', 'я', 'ийск', 
                     'аш', 'пол', 'ича', 'и', 'етвенн', 'изатор', 'чонок', 
                     'шеств', 'овиц', 'уг', 'ох', 'овищ', 'ург', 'юрок', 'лец', 
                     'ени', 'иц', 'овк', 'аниц', 'иноч', 'ническ', 'ал', 'юй',
                     'ошеньк', 'тв', 'юш', 'жд', 'исм', 'ыноч', 'юрк', 'нец', 'оч',
                     'ее', 'ив', 'ому', 'е', 'арик', 'ся', 'р', 'ству', 'юшеч', 'по', 
                     'ственн', 'нок', 'ыг', 'абель', 'уш', 'етк', 'ина', 'ие', 'ёхоньк',
                     'ёвщик', 'енич', 'бач', 'нича', 'юл', 'ущ', 'авич', 'енец', 'ан', 
                     'бес', 'ве', 'ове', 'ца', 'ех', 'ёныш', 'из', 'ис', 'ёшн', 'унч',
                     'енк', 'ист', 'юю', 'льщин', 'че', 'ивн', 'ероч', 'щич', 'ож', 
                     'евич', 'лен', 'яв', 'утчик', 'бан', 'бин', 'фиц', 'аг', 'ам', 
                     'ёни', 'ерд', 'ёв', 'теп', 'ышек', 'тий', 'ебн', 'отн', 'ящ', 
                     'нь', 'авиц', 'тьб', 'стви', 'яж', 'ённост', 'ёнк', 'ёжк', 'ум',
                     'ых', 'овщин', 'ёж', 'ти', 'оноч', 'айк', 'щин', 'тай', 'уль',
                     'вш', 'мост', 'ейн', 'ольнич', 'ёб', 'онек', 'енек', 'инит', 
                     'ые', 'ог', 'ить', 'енч', 'ус', 'ят', 'ьё', 'б', 'авл', 'ива', 
                     'няк', 'ангий', 'ац', 'тк', 'тух', 'аф', 'ю', 'ифиц', 'униц',
                     'ёнок', 'тыр', 'ивл', 'з', 'енци', 'д', 'льц', 'ёшеньк', 'г',
                     'льниц', 'изаци', 'ев', 'соб', 'егда', 'оньки', 'ян', 'очн', 
                     'аз', 'ор', 'овств', 'ерь', 'шки', 'атич', 'ли', 'чук', 'ыден',
                     'ву', 'ость', 'ас', 'ё', 'льч', 'ильн', 'ык', 'ельщиц', 'уал',
                     'ерт', 'ёч', 'ёхонек', 'либо', 'юх', 'ка', 'нибудь', 'ыв', 'шк', 
                     'честв', 'унок', 'енник', 'пис', 'ах', 'юда', 'ани', 'инец', 'анн', 
                     'ульк', 'еж', 'ительн', 'иров', 'енств', 'ма', 'теб', 'ушек', 
                     'й', 'елин', 'юг', 'ясоч', 'енск', 'еник', 'м', 'ествл', 'ль',
                     'ник', 'няч', 'шеньки', 'евен', 'аст', 'езн', 'рав', 'ёшенек',
                     'ышеч', 'вь', 'жды', 'ево', 'нн', 'ун', 'ач', 'евщиц', 'арь', 
                     'анк', 'вов', 'лин', 'ашн', 'уз', 'ез', 'инок', 'ов', 'оль', 
                     'инск', 'уч', 'юк', 'лёнок', 'айш', 'ир', 'иг', 'онн', 'явк',
                     'есть', 'онок', 'рёхонек', 'ебник', 'ичн', 'яш', 'ч', 'ёл', 
                     'бы', 'ическ', 'тельств', 'вет', 'тус', 'рубл', 'лич', 'овник',
                     'ять', 'нов', 'яб', 'урк', 'ешниц', 'уроч', 'еч', 'оз', 'евищ',
                     'ел', 'юж', 'ёх', 'ловк', 'ествов', 'яческ', 'яг', 'итян', 'ом',
                     'еш', 'ачок', 'ниц', 'оид', 'ья', 'ячок', 'лоч', 'ушк', 'ешн', 
                     'юсеньк', 'онк', 'ный', 'овизн', 'ы', 'овщик', 'яч', 'ельг', 'ыт',
                     'ва', 'степ', 'атк', 'метр', 'авч', 'обн', 'лк', 'ант', 'лиц',
                     'авец', 'лыцик', 'ячь', 'туш', 'авк', 'ть', 'ачей', 'сь', 'ров', 
                     'лищ', 'ар', 'ёрк', 'его', 'озн', 'ьн', 'шик', 'ител', 'чуг', 
                     'ашк', 'ед', 'ол', 'ност', 'евл', 'иан', 'яр', 'ишник', 'мен', 
                     'уж', 'ид', 'льник', 'ав', 'cя', 'яй', 'ен', 'ёр', 'ат', 'ес', 
                     'ём', 'льн', 'ючи', 'як', 'ушч', 'чат', 'иш', 'итв', 'ос', 'ку',
                     'еств', 'ович', 'итель', 'при', 'знь', 'иль', 'тельн', 'юр', 
                     'овит', 'овч', 'менн', 'ард', 'ечк', 'ытьб', 'яни', 'итет', 
                     'ях', 'рас', 'ут', 'ыр', 'енн', 'юду', 'к', 'атизм', 'онеч', 
                     'ичеств', 'ем', 'ушок', 'уй', 'ешек', 'отер', 'ну', 'еск', 'альн',
                     'еб', 'чич', 'овл', 'альон', 'атик', 'вств', 'ым', 'охоньк', 
                     'то', 'авоч', 'амт', 'шиц', 'ур', 'ёс', 'ошн', 'юч', 'ств', 
                     'льшик', 'ечок', 'еии', 'айз', 'юн', 'сн', 'город', 'юд', 'огда',
                     'ынд', 'ощав', 'ыва', 'ц', 'овск', 'евёл', 'ова', 'ачь', 'о', 'ушеч',
                     'иньк', 'лив', 'бищ', 'но', 'ень', 'опси', 'ш', 'ятник', 'х', 'ер', 
                     'ец', 'ыш', 'уаль', 'ячк', 'те', 'ённ', 'овн', 'ешк', 'хар', 'льщик',
                     'ёш', 'юз', 'ениц', 'изиров', 'енеч', 'вши', 'инг', 'а', 'альност',
                     'стр', 'лян', 'ей', 'няж', 'нич', 'ай', 'оньк', 'енёк', 'овил', 'ён',
                     'чин', 'енин', 'ье', 'ёт', 'ий', 'ющ', 'тель', 'ош', 'ёвк', 'юзг', 
                     'яка', 'яд', 'отур', 'унец', 'ск', 'ишк', 'уточ', 'аци', 'лыциц', 'ищ', 
                     'ошк', 'ащ', 'емент', 'евт', 'ловец', 'инк', 'чик', 'изов', 'овист',
                     'ерыж', 'ете', 'льщиц', 'ек', 'ему', 'атин', 'ырь', 'евик', 'фик', 'ию', 
                     'ашлив', 'ит', 'ейк', 'ышк', 'янн', 'тел', 'лан', 'нат', 'яп', 'ольник',
                     'аточ', 'бельн', 'ильщиц', 'атай', 'ик', 'аль', 'ух', 'ами', 'щ', 'арий',
                     'я', 'их', 'ую', 'люж', 'есц', 'ест', 'овщиц', 'ок', 'юс', 'евн',
                     'енц', 'ни', 'щик', 'ствов', 'анци', 'ня', 'ческ', 'ою', 'анёк', 'ализм',
                     'ать', 'т', 'ак', 'ент', 'чуж', 'ляв', 'енок', 'ние', 'еньк', 'ж', 
                     'без', 'ошеч', 'ивани', 'изн', 'ста', 'ше', 'атар', 'ин', 'атор', 
                     'им', 'анс', 'уда', 'арн', 'изм', 'ыл', 'оточ', 'ифик', 'ыдн', 'в',
                     'овик', 'яшк', 'чак', 'ынк', 'у', 'хр', 'чонк', 'яст', 'евел', 'ательн', 
                     'ил', 'ещ', 'рог', 'хор', 'с', 'овец', 'яск', 'ене', 'мо', 'янин', 
                     'мя', 'люг', 'ствл', 'н', 'иньки', 'ют', 'ул', 'ост', 'мер', 'за', 
                     'ельн', 'тур', 'л', 'e', 'сам', 'ое', 'йн', 'есн', 'ёвщиц', 'об',
                     'ич', 'екс', 'аж', 'ишн', 'на', 'нач', 'вл', 'сен', 'ёк', 'ничеств',
                     'ател', 'отк', 'ын', 'ельщик', 'утк', 'юшк', 'ь', 'еть', 'яс', 
                     'ия', 'емн', 'оц', 'чиш', 'нут', 'яц', 'тяй', 'овин', 'ощ', 'еват',
                     'ой', 'янк', 'ячеств', 'ивк', 'ловск', 'ешник', 'ёжн', 'рез', 
                     'ад', 'ет', 'ии', 'шн', 'закон', 'ёвск', 'он', 'ый', 'ми', 'ерыг', 
                     'очк', 'ушник', 'зн', 'ель', 'тор', 'теч', 'ерк', 'щиц', 'авник', 
                     'оват', 'ыч', 'алей', 'ома', 'или', 'ярн', 'сел', 'чив', 'ышн', 
                     'чиц', 'венн', 'ильщик', 'нй', 'ичк', 'ейш', 'ёноч', 'евш', 'ованн', 'еванн')
        return(mysfx)